---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.StairsPathType
source: html/905946d3-a106-6708-9b53-8d9fd07e77ca.htm
---
# StairsPathType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.